---
kind: method
id: M:Autodesk.Revit.DB.ElementWorksetFilter.#ctor(Autodesk.Revit.DB.WorksetId)
source: html/08cf87f2-c848-0af0-21b1-72eb326fcbbf.htm
---
# Autodesk.Revit.DB.ElementWorksetFilter.#ctor Method

Constructs a new instance of a filter to match elements in a given workset.

## Syntax (C#)
```csharp
public ElementWorksetFilter(
	WorksetId worksetId
)
```

## Parameters
- **worksetId** (`Autodesk.Revit.DB.WorksetId`) - The workset id to match.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null